{
    "questions": [
        "How do you feel about working in a team environment?",
        "Share an example of when you demonstrated strong teamwork skills",
        "Share an example of a team project that failed",
        "What makes a team function successfully?",
        "What strategies would you use to motivate your team?",
        "Have you ever struggled to collaborate with a manager or team?",
        "Have you ever had to work with someone you didn't get along with? How did you handle it?",
        "What role do you think you usually play in a team?",
        "Suppose one of your team members is constantly falling behind. How would you respond?",
        "Tell me about the most successful group project you’ve ever been part of. What made it so successful?",
        "What do you think makes a team work successfully?",
        "Why/how do you think teamwork is beneficial to success at an organizational level?",
        "Tell me about yourself/your work experience",
        "Walk me through your resume",
        "How did you hear about this position?",
        "Why do you want to work at this company?",
        "Why do you want this job?",
        "Why should we hire you?",
        "What can you bring to the company?",
        "What are your strengths?",
        "Tell me about yourself.",
        "Walk me through your resume.",
        "What are your strengths?",
        "What are your weaknesses?",
        "Why did you leave your last job?",
        "Why are you looking for a new job?",
        "What are your career goals?",
        "Where do you see yourself in 5 years?",
        "Where do you see yourself in 10 years?",
        "What are you passionate about?",
        "What are your hobbies and interests outside of work?",
        "What motivates you?",
        "What are you proudest of?",
        "Describe a time you failed. What did you learn?",
        "What's your biggest accomplishment?",
        "What's your biggest regret?",
        "How would your friends/colleagues describe you?",
        "What are three positive things your last boss would say about you?",
        "What are three things your last boss might say you need to improve on?",
        "What kind of work environment are you looking for?",
        "What are your salary expectations? (Be prepared to answer this carefully or defer if appropriate)",
        "Why are you interested in this role?",
        "Why are you interested in our company?",
        "What do you know about our company?",
        "What are your understanding of the responsibilities of this role?",
        "What skills and experience make you a good fit for this role?",
        "How do you think you can contribute to our team/company?",
        "What are your expectations for this role?",
        "What are you looking for in your next role?",
        "What challenges are you looking for in a new position?",
        "Why should we hire you?",
        "What makes you different from other candidates?",
        "What are your thoughts on [industry trend]?",
        "Where do you see this industry heading in the next few years?",
        "What questions do you have for me? (Always have a few thoughtful questions ready!)",
        "Tell me about a time you faced a challenging situation and how you handled it.",
        "Describe a time you had to work with a difficult colleague or team member.",
        "Tell me about a time you had to persuade someone to see your point of view.",
        "Describe a time you had to make a difficult decision.",
        "Tell me about a time you took initiative.",
        "Describe a time you went above and beyond what was expected of you.",
        "Tell me about a time you had to learn something new quickly.",
        "Describe a time you had to adapt to a significant change.",
        "Tell me about a time you had to prioritize multiple tasks with deadlines.",
        "Describe a time you had to deal with a dissatisfied customer.",
        "Tell me about a time you had a conflict with your boss.",
        "Describe a time you had to work under pressure.",
        "Tell me about a time you failed to meet a deadline. What did you do?",
        "Describe a time you had to give constructive feedback.",
        "Tell me about a time you received constructive feedback. How did you react?",
        "Describe a time you had to lead a team.",
        "Tell me about a time you were part of a successful team. What was your role?",
        "Describe a time you had to work independently.",
        "Tell me about a time you had to solve a complex problem.",
        "Describe a time you had to be creative to find a solution.",
        "Tell me about a time you had to deal with ambiguity.",
        "Describe a time you had to communicate a difficult message.",
        "Tell me about a time you had to negotiate.",
        "Describe a time you had to build a relationship with someone difficult.",
        "Tell me about a time you had to learn from a mistake.",
        "Describe a time you had to advocate for something you believed in.",
        "Imagine you disagree with your boss on a project. How would you handle it?",
        "What would you do if you noticed a colleague was not meeting expectations?",
        "How would you handle a situation where you had multiple urgent deadlines?",
        "If you made a mistake that had a negative impact on the team, what would you do?",
        "How would you handle a demanding client?",
        "Imagine you are leading a team and a member is consistently underperforming. How would you address this?",
        "What would you do if you identified a more efficient way to complete a task that goes against current procedures?",
        "How would you handle a situation where you felt your contributions were not being recognized?",
        "Imagine you are working on a project and a key team member suddenly becomes unavailable. How would you proceed?",
        "How would you respond to negative feedback from a supervisor?",
        "How do you handle stress and pressure?",
        "How do you stay organized?",
        "How do you prioritize tasks?",
        "What are your communication skills like?",
        "How do you handle conflict?",
        "How do you work in a team environment?",
        "Are you a leader or a follower?",
        "How do you approach problem-solving?",
        "How do you handle failure?",
        "How do you stay motivated?",
        "How do you adapt to change?",
        "How do you learn new things?",
        "What are your technical skills? (Be specific to the role)",
        "What software or tools are you proficient in?",
        "How would you describe your work ethic?",
        "What is your leadership style?",
        "How do you measure success?",
        "What are your time management skills like?",
        "How do you handle criticism?",
        "How do you ensure accuracy in your work?",
        "Do you have any questions for me?",
        "What are your salary expectations? (May come up again)",
        "What are your availability to start?",
        "Is there anything else you would like us to know?",
        "What are the next steps in the hiring process?",
        "When can we expect to hear back from you?",
        "Thank you for your time. Do you have any final thoughts?",
        "What are your long-term professional goals? (May be revisited)",
        "How do you see this role helping you achieve your career goals?",
        "What's the most important thing you're looking for in a new job?"
    ]
}